tutorials/solution-time/SIPM-M/threeCavity/momPred/caseD/system/cavityR/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat	raw;
surfaceFormat     raw;

sets
(
    TatYLine
    {
        type            uniform;
        name            cut;
        axis            x;
        start           (-1.2 0.5 0);
        end             (-.2 0.5 0);
        nPoints         100;
    }
    /*TatXLine
    {
        type            uniform;
        name            cut;
        axis            distance;
        start           (0.5 0 0);
        end             (0.5 1 0);
        nPoints         100;
    }*/
);

surfaces
(
    right
    {
        type            patch;    // always triangulated
	patchName	right;        
        interpolate     true;
        triangulate false;
    }

);


fields
(
	//Usolid
	T
);


// ************************************************************************* //
